app/Controllers/Dashboard.php

	public function index()
	{
		$pins = $this->pinModel->findAll();
---
SELECT *
FROM `pins`