app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'dimas@gmail.com'
 LIMIT 1
---
    public function create()
    {
        try {
            $validate = $this->validate([
                'email' => 'required',
                'password' => 'required',
            ]);

            if(!$validate) {
                session()->setFlashData("errors", $this->validator->listErrors());
                return redirect()->to(previous_url())->withInput();
            }

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $this->userModel
                    ->where('email', $email)
                    ->first();