app/Controllers/Pin.php

    public function index()
    {
        $id = session()->get('id');

        $pins = $this->pinModel->where('id_user', $id)->paginate(2, 'pins');
---
SELECT *
FROM `pins`
WHERE `id_user` = '5'
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `pins`
WHERE `id_user` = '5'

    public function show($id = null)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('comments');
        $builder->select('comments.comment');
        $builder->select('users.name');
        $builder->select('pins.caption', 'pins.location', 'pins.hashtag', 'pins.uploads');
        $builder->join('pins', 'comments.id_pin = pins.id');
        $builder->join('users', 'comments.id_user = users.id');
        $builder->where('id_pin', $id);
        $query = $builder->get()->getResultArray();

        $pin = $this->pinModel->where('id', $id)->first();
---
SELECT `comments`.`comment`, `users`.`name`, `pins`.`caption`
FROM `comments`
JOIN `pins` ON `comments`.`id_pin` = `pins`.`id`
JOIN `users` ON `comments`.`id_user` = `users`.`id`
WHERE `id_pin` = '4'
SELECT *
FROM `pins`
WHERE `id` = '4'
 LIMIT 1