app/Controllers/Profile.php

    public function index()
    {
        $id = session()->get('id');
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'